/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "„%@”";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "Az érték érvénytelen.";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "A(z) %@ érték érvénytelen.";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "Kérem, adjon meg egy érvényes értéket.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "Az érték érvénytelen.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "A(z) %@ érték érvénytelen.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "Az érték túl kicsi.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "Az érték túl nagy.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "Kérem, adjon meg egy érvényes értéket.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "Kérem, adjon meg egy %@ értéknél nem kisebb számot.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "Kérem, adjon meg egy %1$@ és %2$@ közötti számot.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "Kérem, adjon meg egy %@ értéknél nem nagyobb számot.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "A(z) %@ érték túl kicsi.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "A(z) %@ érték túl nagy.";

/* NSFileLockingError */
"Err255-C" = "A fájl nem zárolható.";

/* NSFileLockingError */
"Err255-R" = "Lehet, hogy a fájl már zárolt, vagy Ön nem rendelkezik a zárolásához szükséges jogosultsággal.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "A(z) „%@” fájl nem zárolható.";

/* NSFileReadUnknownError */
"Err256" = "A fájl nem nyitható meg.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "A(z) „%@” fájl nem nyitható meg.";

/* NSFileReadNoPermissionError */
"Err257" = "A fájl nem nyitható meg, mert Önnek nincs jogosultsága annak megtekintéséhez.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Ön nem rendelkezik jogosultsággal.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "A jogosultságok megtekintéséhez vagy módosításához jelöljön ki egy elemet a Finder segítségével, és válassza ki a Fájl > Infó megjelenítése menüelemet.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "A(z) „%@” fájl nem nyitható meg, mert Önnek nincs jogosultsága annak megtekintéséhez.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "A fájlnév érvénytelen.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Az elem nem nyitható meg, mert a(z) „%@” fájlnév érvénytelen.";

/* NSFileReadCorruptFileError */
"Err259" = "A fájl nem nyitható meg, mert nem helyes formátumú.";

/* NSFileReadCorruptFileError */
"Err259-C" = "A fájl nem helyes formátumú.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Lehet, hogy a fájl sérült, csonkolt vagy váratlan formátumú.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "A(z) „%@” fájl nem nyitható meg, mert nem helyes formátumú.";

/* NSFileReadNoSuchFileError */
"Err260" = "A fájl nem nyitható meg, mert nem létezik.";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "A(z) „%@” mappa nem létezik.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "A fájl nem létezik.";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "A mappa nem létezik.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "A(z) „%@” fájl nem nyitható meg, mert nincs ilyen fájl.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "A fájl nem nyitható meg a megadott szövegkódolás használatával.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "A megadott szövegkódolás nem alkalmazható.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "A(z) %@ szövegkódolás nem alkalmazható.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Lehet, hogy a fájl eltérő szövegkódolással lett elmentve, vagy pedig nem szövegfájl.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "A fájl nem nyitható meg a(z) %@ szövegkódolás használatával.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "A(z) „%2$@” fájl nem nyitható meg a(z) %1$@ szövegkódolás használatával.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "A fájl nem nyitható meg, mert a megadott URL-típus nem támogatott.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "A megadott URL-típus nem támogatott.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "A(z) „%1$@” fájl nem nyitható meg, mert a(z) %2$@ URL-típus nem támogatott.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "A fájl nem nyitható meg, mert a(z) %@ URL-típus nem támogatott.";

/* NSFileReadTooLargeError */
"Err263" = "A fájl nem nyitható meg, mert túl nagy.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "A fájl túl nagy.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "A(z) „%@” fájl nem nyitható meg, mert túl nagy.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "A fájl nem nyitható meg, mert a tartalom szövegkódolása nem határozható meg.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "A tartalom szövegkódolása nem határozható meg.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "A szövegkódolás megadásával talán megnyithatja a fájlt.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "A(z) „%@” fájl nem nyitható meg, mert tartalmának szövegkódolása nem határozható meg.";

/* NSUserCancelledError */
"Err3072-C" = "A művelet vissza lett vonva.";

/* NSPropertyListCorruptError */
"Err3840" = "Az adat nem olvasható, mert sérült.";

/* NSPropertyListCorruptError */
"Err3840-C" = "Az adat sérült.";

/* NSPropertyListUnknownVersionError */
"Err3841" = "Az adat nem olvasható, mert olyan formátumú, melyet ez az alkalmazás nem ért meg.";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "Az adat olyan formátumú, melyet ez az alkalmazás nem ért meg.";

/* NSPropertyListReadStreamError */
"Err3842" = "Az adat nem olvasható, mert az adatok forrási helyén hiba van.";

/* NSPropertyListReadStreamError */
"Err3842-C" = "Az adat forrási helyén hiba lépett fel.";

/* NSPropertyListWriteStreamError */
"Err3851" = "Az adat nem írható, mert az adatok rendeltetési helyén hiba van.";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "Az adat rendeltetési helyén hiba lépett fel.";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "A(z) „%@” mappa nem létezik.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "A(z) „%@” nem távolítható el.";

/* NSFileNoSuchFileError */
"Err4-C" = "A fájl nem létezik.";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "A mappa nem létezik.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "A(z) „%@” fájl nem létezik.";

/* NSFileWriteUnknownError */
"Err512" = "A fájl nem menthető el.";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "A(z) „%1$@” fájl nem menthető el, mert a tartalékmásolati fájl nem frissíthető.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "A(z) „%1$@” nem másolható a(z) „%2$@” helyre.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "A(z) „%1$@” nem linkelhető a(z) „%2$@” helyre.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "A(z) „%1$@” nem mozgatható a(z) „%2$@” helyre.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "A(z) „%@” nem távolítható el.";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "A tartalékmásolati fájl nem menthető el.";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "Lehet, hogy a tartalékmásolati fájl zárolva van, vagy Önnek nincs jogosultsága elmenteni azt. A jogosultságok megtekintéséhez vagy módosításához válassza ki az elemet a Finderben, és válassza ki a Fájl > Infó megjelenítése menüelemet.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "A(z) „%2$@” fájl nem menthető a(z) „%1$@” mappába.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "A(z) „%@” fájl nem menthető el.";

/* NSFileWriteNoPermissionError */
"Err513" = "A fájl nem menthető el, mert Önnek nincs jogosultsága.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "A(z) „%1$@” nem másolható, mert Önnek nincs jogosultsága a(z) „%2$@” hozzáféréséhez.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "A(z) „%1$@” nem linkelhető, mert Önnek nincs jogosultsága a(z) „%2$@” hozzáféréséhez.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "A(z) „%1$@” nem mozgatható, mert Önnek nincs jogosultsága a(z) „%2$@” hozzáféréséhez.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "A(z) „%@” nem távolítható el, mert Önnek nincs jogosultsága annak hozzáféréséhez.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Ön nem rendelkezik jogosultsággal.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "A jogosultságok megtekintéséhez vagy módosításához jelöljön ki egy elemet a Finder segítségével, és válassza ki a Fájl > Infó megjelenítése menüelemet.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Nincs jogosultsága a(z) „%2$@” fájl „%1$@” mappába történő elmentésére.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Nincs jogosultsága a(z) „%@” fájl elmentésére.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Az elem nem menthető el, mert a fájlnév érvénytelen.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Az elem nem távolítható el, mert a(z) „%@” fájlnév érvénytelen.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "A fájlnév érvénytelen.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Az elem nem menthető el, mert a(z) „%@” fájlnév érvénytelen.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "A fájl nem menthető el a megadott szövegkódolás használatával.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "A megadott szövegkódolás nem alkalmazható.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "A(z) %@ szövegkódolás nem alkalmazható.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Amennyiben lehetséges, válasszon eltérő szövegkódolást.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "A fájl nem menthető el a(z) %@ szövegkódolás használatával.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "A(z) „%2$@” fájl nem menthető el a(z) %1$@ szövegkódolás használatával.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "A fájl nem menthető el, mert a megadott URL-típus nem támogatott.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "A megadott URL-típus nem támogatott.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "A(z) „%1$@” fájl nem menthető el, mert a(z) %2$@ URL-típus nem támogatott.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "A fájl nem menthető el, mert a(z) %@ URL-típus nem támogatott.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "A fájl nem menthető el, mert nincs elég hely.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "A(z) „%1$@” nem másolható a(z) „%2$@” helyre, mert nincs elég hely.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "A(z) „%1$@” nem linkelhető a(z) „%2$@” helyre, mert nincs elég hely.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "A(z) „%1$@” nem mozgatható „%2$@” helyre, mert nincs elég hely.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Nincs elég hely.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "A(z) „%@” köteten elfogyott a hely.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Távolítson el fájlokat a kötetről, majd próbálja újra.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Nem mentheti el a(z) „%@” fájlt, mert nincs elég hely.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Nem mentheti el a(z) „%1$@” fájlt, mert a(z) „%2$@” köteten elfogyott a hely.";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "A fájl nem menthető el, mert a kötet csak-olvasható.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "A kötet csak-olvasható.";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "A(z) „%@” kötet csak-olvasható.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "Próbálja másik kötetre menteni a fájlt.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "Nem mentheti el a(z) „%@” fájlt, mert a kötet csak-olvasható.";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "Nem mentheti el a(z) „%1$@” fájlt, mert a(z) „%2$@” kötet csak-olvasható.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "A művelet nem hajtható végre. (%1$@ hiba %2$ld.)";

